<h1>Data Science Competition 2019 - Elimination Round</h1>

<h5>Ini Kita - IPB University</h5>

<h2>Import Packages</h2>

In [56]:
library(dplyr)

<h2>Load the Raw Data</h2>

In [57]:
# Load the Employee Data and Location Data
data.location = read.csv(file = 'D:/Audhi Aprilliant/Personal Data/Scientific Essay Competitions/STATISTICS COMPETITION/Data Science Academy 2019/Elimination Round/Datasets/catatan_lokasi.csv',
                         header = TRUE,
                         sep = ',')

In [58]:
data.location = tbl_df(data.location)

In [59]:
glimpse(data.location)

Observations: 2,600
Variables: 3
$ id             <int> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 1...
$ tanggal        <fct> 21/05/19, 21/05/19, 21/05/19, 21/05/19, 21/05/19, 21...
$ lokasi_dominan <fct> Jakarta Pusat, Kabupaten Bogor, Jakarta Pusat, Kota ...

In [60]:
head(data.location)

  id tanggal  lokasi_dominan
1 1  21/05/19 Jakarta Pusat
2 2  21/05/19 Kabupaten Bogor
3 3  21/05/19 Jakarta Pusat
4 4  21/05/19 Kota Tangerang
5 5  21/05/19 Kota Bogor
6 6  21/05/19 Kota Bogor

In [61]:
# Load the Employee Data and Location Data
data.employee = read.csv(file = 'D:/Audhi Aprilliant/Personal Data/Scientific Essay Competitions/STATISTICS COMPETITION/Data Science Academy 2019/Elimination Round/Datasets/data_profil.csv',
                         header = TRUE,
                         sep = ',')

In [62]:
data.employee = tbl_df(data.employee)

In [63]:
glimpse(data.employee)

Observations: 100
Variables: 4
$ id            <int> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16...
$ jenis_kelamin <fct> Laki-laki, Laki-laki, Laki-laki, Perempuan, Perempuan...
$ divisi        <fct> Customer Service, Data Engineer, Software Engineer, B...
$ umur          <int> 34, 26, 28, 21, 21, 28, 21, 22, 21, 21, 25, 28, 25, 2...

In [64]:
head(data.employee)

  id jenis_kelamin divisi                umur
1 1  Laki-laki     Customer Service      34
2 2  Laki-laki     Data Engineer         26
3 3  Laki-laki     Software Engineer     28
4 4  Perempuan     Business Intelligence 21
5 5  Perempuan     Software Engineer     21
6 6  Laki-laki     Business Intelligence 28

<h2>Convert Data - Normalization</h2>

In [65]:
data.column = data.location

In [66]:
# Make Index
bottom.trace = seq(from = 1,to = dim(data.column)[1],by = dim(data.employee)[1])
up.trace = seq(from = 100,to = dim(data.column)[1],by = dim(data.employee)[1])
up.trace = up.trace
data.final = data.employee[,]

# Function for convert the data
for(i in 1:length(up.trace)) {
    data.split = data.column[bottom.trace[i]:up.trace[i],3]
    data.final = cbind(data.final,
                        data.split)
}

In [67]:
head(data.final)

  id jenis_kelamin divisi                umur lokasi_dominan  lokasi_dominan.1
1 1  Laki-laki     Customer Service      34   Jakarta Pusat   Jakarta Pusat
2 2  Laki-laki     Data Engineer         26   Kabupaten Bogor Kabupaten Bogor
3 3  Laki-laki     Software Engineer     28   Jakarta Pusat   Jakarta Timur
4 4  Perempuan     Business Intelligence 21   Kota Tangerang  Kota Tangerang
5 5  Perempuan     Software Engineer     21   Kota Bogor      Jakarta Barat
6 6  Laki-laki     Business Intelligence 28   Kota Bogor      Jakarta Utara
  lokasi_dominan.2 lokasi_dominan.3 lokasi_dominan.4 lokasi_dominan.5 ...
1 Jakarta Pusat    Kota Bekasi      Kota Bekasi      Kota Medan       ...
2 Jakarta Selatan  Kabupaten Bogor  Kabupaten Bogor  Kabupaten Bogor  ...
3 Kota Bekasi      Kabupaten Bekasi Jakarta Timur    Jakarta Timur    ...
4 Jakarta Utara    Kota Tangerang   Kota Tangerang   Kota Tangerang   ...
5 Jakarta Barat    Jakarta Barat    Jakarta Barat    Jakarta Barat    ...
6 Kota Depok       Kota Depok       Kota Depok       Kota Depok       ...
  lokasi_dominan      lokasi_dominan.1    lokasi_dominan.2
1 Kota Padang         Kota Padang         Kota Padang
2 Kota Manado         Kota Manado         Kota Manado
3 Kota Padang         Kota Padang         Kota Depok
4 Kota Bandar Lampung Kota Bandar Lampung Kota Bandar Lampung
5 Kota Yogyakarta     Kota Yogyakarta     Kota Yogyakarta
6 Kabupaten Sleman    Kabupaten Sleman    Kabupaten Sleman
  lokasi_dominan.3       lokasi_dominan.4   lokasi_dominan.5 lokasi_dominan.6
1 Kota Padang            Kota Padang        Kota Bekasi      Kota Bekasi
2 Kota Manado            Jakarta Timur      Kabupaten Bogor  Kabupaten Bogor
3 Jakarta Timur          Kabupaten Bekasi   Jakarta Timur    Kabupaten Bekasi
4 Kota Tangerang Selatan Kota Tangerang     Kota Tangerang   Kota Tangerang
5 Kota Bandung           Jakarta Barat      Jakarta Barat    Jakarta Barat
6 Kabupaten Wonogiri     Kabupaten Wonogiri Kota Depok       Kota Depok
  lokasi_dominan.7 lokasi_dominan.8 lokasi_dominan.9
1 Jakarta Pusat    Jakarta Pusat    Jakarta Pusat
2 Jakarta Selatan  Kabupaten Bogor  Kabupaten Bogor
3 Kota Bekasi      Jakarta Timur    Jakarta Pusat
4 Jakarta Utara    Kota Tangerang   Kota Tangerang
5 Jakarta Barat    Jakarta Barat    Kota Bogor
6 Kota Depok       Jakarta Utara    Kota Bogor

In [68]:
# Column Names for new Dataset
date.num = c(21:31,1:15)
date.num = paste(c(rep('May',11),
                   rep('June',15)),
                 date.num,
                 sep = '_')

In [69]:
colnames(data.final)[5:dim(data.final)[2]] = date.num
colnames(data.final)

 [1] "id"            "jenis_kelamin" "divisi"        "umur"
 [5] "May_21"        "May_22"        "May_23"        "May_24"
 [9] "May_25"        "May_26"        "May_27"        "May_28"
[13] "May_29"        "May_30"        "May_31"        "June_1"
[17] "June_2"        "June_3"        "June_4"        "June_5"
[21] "June_6"        "June_7"        "June_8"        "June_9"
[25] "June_10"       "June_11"       "June_12"       "June_13"
[29] "June_14"       "June_15"

In [70]:
head(data.final)

  id jenis_kelamin divisi                umur May_21          May_22
1 1  Laki-laki     Customer Service      34   Jakarta Pusat   Jakarta Pusat
2 2  Laki-laki     Data Engineer         26   Kabupaten Bogor Kabupaten Bogor
3 3  Laki-laki     Software Engineer     28   Jakarta Pusat   Jakarta Timur
4 4  Perempuan     Business Intelligence 21   Kota Tangerang  Kota Tangerang
5 5  Perempuan     Software Engineer     21   Kota Bogor      Jakarta Barat
6 6  Laki-laki     Business Intelligence 28   Kota Bogor      Jakarta Utara
  May_23          May_24           May_25          May_26          ...
1 Jakarta Pusat   Kota Bekasi      Kota Bekasi     Kota Medan      ...
2 Jakarta Selatan Kabupaten Bogor  Kabupaten Bogor Kabupaten Bogor ...
3 Kota Bekasi     Kabupaten Bekasi Jakarta Timur   Jakarta Timur   ...
4 Jakarta Utara   Kota Tangerang   Kota Tangerang  Kota Tangerang  ...
5 Jakarta Barat   Jakarta Barat    Jakarta Barat   Jakarta Barat   ...
6 Kota Depok      Kota Depok       Kota Depok      Kota Depok      ...
  June_6              June_7              June_8
1 Kota Padang         Kota Padang         Kota Padang
2 Kota Manado         Kota Manado         Kota Manado
3 Kota Padang         Kota Padang         Kota Depok
4 Kota Bandar Lampung Kota Bandar Lampung Kota Bandar Lampung
5 Kota Yogyakarta     Kota Yogyakarta     Kota Yogyakarta
6 Kabupaten Sleman    Kabupaten Sleman    Kabupaten Sleman
  June_9                 June_10            June_11         June_12
1 Kota Padang            Kota Padang        Kota Bekasi     Kota Bekasi
2 Kota Manado            Jakarta Timur      Kabupaten Bogor Kabupaten Bogor
3 Jakarta Timur          Kabupaten Bekasi   Jakarta Timur   Kabupaten Bekasi
4 Kota Tangerang Selatan Kota Tangerang     Kota Tangerang  Kota Tangerang
5 Kota Bandung           Jakarta Barat      Jakarta Barat   Jakarta Barat
6 Kabupaten Wonogiri     Kabupaten Wonogiri Kota Depok      Kota Depok
  June_13         June_14         June_15
1 Jakarta Pusat   Jakarta Pusat   Jakarta Pusat
2 Jakarta Selatan Kabupaten Bogor Kabupaten Bogor
3 Kota Bekasi     Jakarta Timur   Jakarta Pusat
4 Jakarta Utara   Kota Tangerang  Kota Tangerang
5 Jakarta Barat   Jakarta Barat   Kota Bogor
6 Kota Depok      Jakarta Utara   Kota Bogor

In [71]:
# All Cities in Dataset
unique(data.location$lokasi_dominan)
paste('Number of unique location:',
      summarise(data.location,
                n_distinct(lokasi_dominan)))

 [1] Jakarta Pusat             Kabupaten Bogor
 [3] Kota Tangerang            Kota Bogor
 [5] Kota Depok                Jakarta Timur
 [7] Kota Bekasi               Jakarta Selatan
 [9] Jakarta Utara             Jakarta Barat
[11] Kabupaten Tangerang       Kabupaten Bekasi
[13] Kota Tangerang Selatan    Kota Yogyakarta
[15] Kabupaten Bantul          Kabupaten Wonogiri
[17] Kota Medan                Kota Manado
[19] Kota Bandung              Kabupaten Tasikmalaya
[21] Kota Padang               Kabupaten Sleman
[23] Kota Bandar Lampung       Kota Semarang
[25] Kabupaten Lampung Selatan Kota Surabaya
[27] Kabupaten Kebumen         Kota Banda Aceh
28 Levels: Jakarta Barat Jakarta Pusat Jakarta Selatan ... Kota Yogyakarta

[1] "Number of unique location: 28"

In [72]:
# List of cities in Jabodetabek
cities.jabodetabek = c('Jakarta Pusat','Jakarta Timur','Jakarta Selatan','Jakarta Utara','Jakarta Barat',
                       'Kabupaten Bogor','Kota Bogor',
                       'Kota Depok',
                       'Kota Tangerang','Kabupaten Tangerang','Kota Tangerang Selatan',
                       'Kota Bekasi','Kabupaten Bekasi')
paste('List of Cities in Jabodetabek:')
cities.jabodetabek

[1] "List of Cities in Jabodetabek:"

 [1] "Jakarta Pusat"          "Jakarta Timur"          "Jakarta Selatan"
 [4] "Jakarta Utara"          "Jakarta Barat"          "Kabupaten Bogor"
 [7] "Kota Bogor"             "Kota Depok"             "Kota Tangerang"
[10] "Kabupaten Tangerang"    "Kota Tangerang Selatan" "Kota Bekasi"
[13] "Kabupaten Bekasi"

<h3>Data Mudik Employee - TokoLapak</h3>

In [73]:
data.mudik = data.location
data.mudik$lokasi_dominan = as.character(data.mudik$lokasi_dominan) # Make it as character
data.mudik$status = NULL
for(i in 1:dim(data.mudik)[1]){
    if(data.mudik[i,'lokasi_dominan'] %in% cities.jabodetabek){
        data.mudik[i,'status'] = 1 # In Jabodetabek
    }
    else{
        data.mudik[i,'status'] = 0 # Not in Jabodetabek
    }
}

In [74]:
head(data.mudik)
# Convert into default type
data.mudik$lokasi_dominan = as.factor(data.mudik$lokasi_dominan)
str(data.mudik)
unique(data.mudik$status)

  id tanggal  lokasi_dominan  status
1 1  21/05/19 Jakarta Pusat   1
2 2  21/05/19 Kabupaten Bogor 1
3 3  21/05/19 Jakarta Pusat   1
4 4  21/05/19 Kota Tangerang  1
5 5  21/05/19 Kota Bogor      1
6 6  21/05/19 Kota Bogor      1

Classes 'tbl_df', 'tbl' and 'data.frame':	2600 obs. of  4 variables:
 $ id            : int  1 2 3 4 5 6 7 8 9 10 ...
 $ tanggal       : Factor w/ 26 levels "01/06/19","02/06/19",..: 16 16 16 16 16 16 16 16 16 16 ...
 $ lokasi_dominan: Factor w/ 28 levels "Jakarta Barat",..: 2 8 2 26 19 19 20 20 19 4 ...
 $ status        : num  1 1 1 1 1 1 1 1 1 1 ...

[1] 1 0

In [75]:
# Make Index
bottom.trace = seq(from = 1,to = dim(data.mudik)[1],by = dim(data.employee)[1])
up.trace = seq(from = 100,to = dim(data.mudik)[1],by = dim(data.employee)[1])
up.trace = up.trace
data.mudik.final = data.employee[,]

# Function for convert the data
for(i in 1:length(up.trace)) {
    data.split = data.mudik[bottom.trace[i]:up.trace[i],4]
    data.mudik.final = cbind(data.mudik.final,
                             data.split)
}

In [76]:
head(data.mudik.final)

  id jenis_kelamin divisi                umur status status.1 status.2 status.3
1 1  Laki-laki     Customer Service      34   1      1        1        1
2 2  Laki-laki     Data Engineer         26   1      1        1        1
3 3  Laki-laki     Software Engineer     28   1      1        1        1
4 4  Perempuan     Business Intelligence 21   1      1        1        1
5 5  Perempuan     Software Engineer     21   1      1        1        1
6 6  Laki-laki     Business Intelligence 28   1      1        1        1
  status.4 status.5 ... status status.1 status.2 status.3 status.4 status.5
1 1        0        ... 0      0        0        0        0        1
2 1        1        ... 0      0        0        0        1        1
3 1        1        ... 0      0        1        1        1        1
4 1        1        ... 0      0        0        1        1        1
5 1        1        ... 0      0        0        0        1        1
6 1        1        ... 0      0        0        0        0        1
  status.6 status.7 status.8 status.9
1 1        1        1        1
2 1        1        1        1
3 1        1        1        1
4 1        1        1        1
5 1        1        1        1
6 1        1        1        1

In [77]:
colnames(data.mudik.final)[5:dim(data.mudik.final)[2]] = date.num
colnames(data.mudik.final)

 [1] "id"            "jenis_kelamin" "divisi"        "umur"
 [5] "May_21"        "May_22"        "May_23"        "May_24"
 [9] "May_25"        "May_26"        "May_27"        "May_28"
[13] "May_29"        "May_30"        "May_31"        "June_1"
[17] "June_2"        "June_3"        "June_4"        "June_5"
[21] "June_6"        "June_7"        "June_8"        "June_9"
[25] "June_10"       "June_11"       "June_12"       "June_13"
[29] "June_14"       "June_15"

In [78]:
head(data.mudik.final)

  id jenis_kelamin divisi                umur May_21 May_22 May_23 May_24
1 1  Laki-laki     Customer Service      34   1      1      1      1
2 2  Laki-laki     Data Engineer         26   1      1      1      1
3 3  Laki-laki     Software Engineer     28   1      1      1      1
4 4  Perempuan     Business Intelligence 21   1      1      1      1
5 5  Perempuan     Software Engineer     21   1      1      1      1
6 6  Laki-laki     Business Intelligence 28   1      1      1      1
  May_25 May_26 ... June_6 June_7 June_8 June_9 June_10 June_11 June_12 June_13
1 1      0      ... 0      0      0      0      0       1       1       1
2 1      1      ... 0      0      0      0      1       1       1       1
3 1      1      ... 0      0      1      1      1       1       1       1
4 1      1      ... 0      0      0      1      1       1       1       1
5 1      1      ... 0      0      0      0      1       1       1       1
6 1      1      ... 0      0      0      0      0       1       1       1
  June_14 June_15
1 1       1
2 1       1
3 1       1
4 1       1
5 1       1
6 1       1

In [79]:
# Status 'mudik' Total in Numeric
data.mudik.final$status.num.total = NULL
data.mudik.final$status.num.total = rowSums(data.mudik.final[,5:dim(data.mudik.final)[2]])
summary(data.mudik.final$status.num.total)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
   6.00   15.00   17.00   17.07   19.00   26.00

In [80]:
# Status 'mudik' Total in Factor
data.mudik.final$status.total - NULL
for(i in 1:dim(data.mudik.final)[1]){
    if(data.mudik.final[i,'status.num.total'] == 26){
        data.mudik.final[i,'status.total'] = 1 # Tidak mudik
    }
    else{
        data.mudik.final[i,'status.total'] = 0 # Mudik
    }
}

integer(0)

In [81]:
head(data.mudik.final)

  id jenis_kelamin divisi                umur May_21 May_22 May_23 May_24
1 1  Laki-laki     Customer Service      34   1      1      1      1
2 2  Laki-laki     Data Engineer         26   1      1      1      1
3 3  Laki-laki     Software Engineer     28   1      1      1      1
4 4  Perempuan     Business Intelligence 21   1      1      1      1
5 5  Perempuan     Software Engineer     21   1      1      1      1
6 6  Laki-laki     Business Intelligence 28   1      1      1      1
  May_25 May_26 ... June_8 June_9 June_10 June_11 June_12 June_13 June_14
1 1      0      ... 0      0      0       1       1       1       1
2 1      1      ... 0      0      1       1       1       1       1
3 1      1      ... 1      1      1       1       1       1       1
4 1      1      ... 0      1      1       1       1       1       1
5 1      1      ... 0      0      1       1       1       1       1
6 1      1      ... 0      0      0       1       1       1       1
  June_15 status.num.total status.total
1 1       11               0
2 1       15               0
3 1       21               0
4 1       17               0
5 1       15               0
6 1       12               0

<h2>Do the QUIZ</h2>

<h3>1</h3>
Karyawan dengan id berapa yang memiliki kesempatan untuk membawa makanan oleh-oleh khas Kartika Sari Bandung

In [82]:
data.location %>%
    filter(
        lokasi_dominan == 'Kota Bandung'
    ) %>%
    group_by(id) %>%
    summarise(employee = n()) %>%
    arrange(desc(employee)) %>%
    head()
paste('The answer is:',
     'Employee with ID 21')

  id employee
1 21 15
2 32 13
3 15  9
4 95  7
5 55  5
6  5  2

[1] "The answer is: Employee with ID 21"

<h3>2</h3>
Dengan keadaan dimana salah satu divisi penting di perusahaan TokoLapak ini karyawannya mudik semua, apakah kegiatan jual beli di toko online ini akan tetap berjalan

In [83]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        count = n(),
        count.mudik = sum(status.total),
        perc.mudik = 1-round(x = count.mudik/count,
                             digits = 2)
    ) %>%
    arrange(perc.mudik)
paste('The answer is:',
     'Tidak berjalan alias libur dulu selama lebaran')

  divisi                count count.mudik perc.mudik
1 Software Engineer     31    4           0.87
2 Marketing              9    1           0.89
3 Data Engineer         14    1           0.93
4 Business Intelligence 21    1           0.95
5 Customer Service      15    0           1.00
6 Data Science          10    0           1.00

[1] "The answer is: Tidak berjalan alias libur dulu selama lebaran"

<h3>3</h3>
Divisi apa yang karyawannya paling banyak melakukan mudik

In [84]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        count = n(),
        count.no.mudik = sum(status.total),
        perc.no.mudik = round(x = count.no.mudik/count,
                        digits = 2)
    ) %>%
    arrange(desc(perc.no.mudik))
paste('The answer is:',
     'Software Engineer')

  divisi                count count.no.mudik perc.no.mudik
1 Software Engineer     31    4              0.13
2 Marketing              9    1              0.11
3 Data Engineer         14    1              0.07
4 Business Intelligence 21    1              0.05
5 Customer Service      15    0              0.00
6 Data Science          10    0              0.00

[1] "The answer is: Software Engineer"

<h3>4</h3>
Berapakah umur termuda dari karyawan yang tergabung di divisi Data Science

In [85]:
data.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        minimum.age = min(umur)
    ) %>%
    arrange(desc(minimum.age))
paste('The answer is:',
     '21 Years old')

  divisi                minimum.age
1 Marketing             24
2 Data Engineer         23
3 Customer Service      22
4 Business Intelligence 21
5 Data Science          21
6 Software Engineer     21

[1] "The answer is: 21 Years old"

<h3>5</h3>
Divisi yang semua anggotanya mudik

In [86]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        count = n(),
        count.mudik = sum(status.total),
        perc.mudik = 1-round(x = count.mudik/count,
                             digits = 2)
    ) %>%
    arrange(perc.mudik)
paste('The answer is:',
     'Customer Service and Data Science')

  divisi                count count.mudik perc.mudik
1 Software Engineer     31    4           0.87
2 Marketing              9    1           0.89
3 Data Engineer         14    1           0.93
4 Business Intelligence 21    1           0.95
5 Customer Service      15    0           1.00
6 Data Science          10    0           1.00

[1] "The answer is: Customer Service and Data Science"

<h3>6</h3>
Berapakah jumlah karyawan yang mudik dan tergabung di divisi Data Science

In [87]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    filter(
        status.total == 0 # Mudik
    ) %>%
    summarise(
        count = n()
    ) %>%
    arrange(count)
paste('The answer is:',
     '10 employee')

  divisi                count
1 Marketing              8
2 Data Science          10
3 Data Engineer         13
4 Customer Service      15
5 Business Intelligence 20
6 Software Engineer     27

[1] "The answer is: 10 employee"

<h3>7</h3>
Divisi yang jumlah pemudiknya paling sedikit

In [88]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    filter(
        status.total == 0 # Mudik
    ) %>%
    summarise(
        count = n()
    ) %>%
    arrange(count)
paste('The answer is:',
     'Marketing')

  divisi                count
1 Marketing              8
2 Data Science          10
3 Data Engineer         13
4 Customer Service      15
5 Business Intelligence 20
6 Software Engineer     27

[1] "The answer is: Marketing"

<h3>8</h3>
Berapakah umur karyawan paling senior yang tergabung di divisi Data Engineer

In [89]:
data.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        minimum.age = max(umur)
    ) %>%
    arrange(desc(minimum.age))
paste('The answer is:',
     '35 Years old')

  divisi                minimum.age
1 Business Intelligence 35
2 Customer Service      35
3 Data Engineer         35
4 Data Science          35
5 Marketing             35
6 Software Engineer     34

[1] "The answer is: 35 Years old"

<h3>9</h3>
Karyawan yang memiliki waktu mudik paling lama (perkiraan 20 hari)

In [90]:
data.mudik.final %>%
    select(
        id,
        status.num.total
    ) %>%
    mutate(
        duration = 26-status.num.total
    ) %>%
    arrange(desc(duration)) %>%
head()
paste('The answer is:',
     'Employee with ID 10')

  id status.num.total duration
1 10  6               20
2  1 11               15
3 17 11               15
4 20 11               15
5 21 11               15
6 23 11               15

[1] "The answer is: Employee with ID 10"

<h3>10</h3>
Berapa persen dari karyawan di TokoLapak yang pulang ke Jabodetabek pada tanggal 9 Juni

In [91]:
index.case.10 = which(data.mudik.final[,'June_8'] == 0 &
                      data.mudik.final[,'June_9'] == 1)
case.10 = data.mudik.final[index.case.10,]
perc.case.10 = dim(case.10)[1]/dim(data.mudik.final)[1]
paste('The answer is:',
     perc.case.10)

[1] "The answer is: 0.49"

<h3>11</h3>
Berapa karyawan yang melakukan mudik pada tanggal 30 Mei

In [92]:
index.case.11 = which(data.mudik.final[,'May_30'] == 0 &
                      data.mudik.final[,'May_29'] == 1)
case.11 = data.mudik.final[index.case.11,]
perc.case.11 = dim(case.11)[1]
paste('The answer is:',
     perc.case.11)

[1] "The answer is: 15"

<h3>12</h3>
Kabupaten atau kota manakah yang menjadi tujuan mudik terbanyak

In [93]:
str(data.location$lokasi_dominan)
data.location$lokasi_dominan = as.character(data.location$lokasi_dominan)
index.case.12 = which(as.character(data.location$lokasi_dominan) %in% cities.jabodetabek)
length(index.case.12)
sort(table(data.location[-index.case.12,'lokasi_dominan']),
     decreasing = TRUE)
paste('The answer is:',
     'Kabupten Sleman')

 Factor w/ 28 levels "Jakarta Barat",..: 2 8 2 26 19 19 20 20 19 4 ...

[1] 1707

         Kabupaten Sleman           Kota Yogyakarta                Kota Medan
                      120                       117                        85
              Kota Padang        Kabupaten Wonogiri          Kabupaten Bantul
                       81                        71                        68
Kabupaten Lampung Selatan       Kota Bandar Lampung              Kota Bandung
                       61                        58                        54
            Kota Surabaya             Kota Semarang     Kabupaten Tasikmalaya
                       52                        41                        35
              Kota Manado           Kota Banda Aceh         Kabupaten Kebumen
                       33                        10                         7

[1] "The answer is: Kabupten Sleman"

<h3>13</h3>
Karyawan dengan ID berapakah yang memiliki kesempatan untuk mengunjungi Pantai Karang Bolong Kebumen

In [94]:
data.location %>%
    filter(lokasi_dominan == 'Kabupaten Kebumen')
paste('The answer is:',
      'Employee with ID 18')

  id tanggal  lokasi_dominan
1 18 02/06/19 Kabupaten Kebumen
2 28 03/06/19 Kabupaten Kebumen
3 28 04/06/19 Kabupaten Kebumen
4 28 05/06/19 Kabupaten Kebumen
5 28 06/06/19 Kabupaten Kebumen
6 28 07/06/19 Kabupaten Kebumen
7 18 08/06/19 Kabupaten Kebumen

[1] "The answer is: Employee with ID 18"

<h3>14</h3>
Di hari apakah yang menjadi hari favorit (paling banyak) karyawan TokoLapak melakukan mudik? Asumsikan waktu yang dibutuhkan untuk mudik kurang dari 1 hari dan apabila dia mulai berada di luar Jabodetabek pada hari tersebut, maka hari tersebutlah yang menjadi lokasi dominan seseorang mudik

In [95]:
data.transport = as.data.frame(colSums(data.mudik.final[,5:(dim(data.mudik.final)[2]-2)]))
colnames(data.transport) = c('count')

# Count of employees who have 'mudik'
lag.one = cbind(0,
             t(data.transport[,]))
lag.one = lag.one[-length(lag.one)] # Erase last element in vector move
data.transport = data.frame(data.transport,
                            lag.one)
data.transport %>%
    mutate(
        date = rownames(data.transport),
        count.of.mudik = lag.one - count
    ) %>%
    arrange(desc(count.of.mudik)) %>%    
    head()
paste('The answer is:',
      '31st of May')

  count lag.one date   count.of.mudik
1 42    66      May_31 24
2 66    81      May_30 15
3 27    42      June_1 15
4 81    91      May_29 10
5 17    27      June_2 10
6  7    17      June_3 10

[1] "The answer is: 31st of May"

<h3>15</h3>
Berapa banyak karyawan TokoLapak yang melakukan mudik lebaran 2019?
Catatan diasumsikan bahwa karyawan yang melakukan mudik adalah karyawan yang tidak berada di Jabodetabek pada hari lebaran tanggal 5 Juni 2019

In [96]:
case.15 = 100 - sum(data.mudik.final$June_5)
paste('The answer is:',
      case.15,
      'Employees')

[1] "The answer is: 91 Employees"

<h3>16</h3>
Berapa banyak karyawan yang dapat dititipi oleh-oleh Lapis Legit Dzulaikha langsung dari tokonya

In [97]:
data.location %>%
    group_by(lokasi_dominan) %>%
    summarise(
        employee = n_distinct(id)
    ) %>%
    filter(
        lokasi_dominan == 'Kota Medan'
    )
paste('The answer is:',
      ' 12 Employees')

  lokasi_dominan employee
1 Kota Medan     12

[1] "The answer is:  12 Employees"

<h3>17</h3>
Kota atau kabupaten yang menjadi tujuan mudik paling sedikit

In [98]:
str(data.location$lokasi_dominan)
data.location$lokasi_dominan = as.character(data.location$lokasi_dominan)
index.case.12 = which(as.character(data.location$lokasi_dominan) %in% cities.jabodetabek)
length(index.case.12)
sort(table(data.location[-index.case.12,'lokasi_dominan']),
     decreasing = FALSE)
paste('The answer is:',
     'Kabupten Kebumen')

 chr [1:2600] "Jakarta Pusat" "Kabupaten Bogor" "Jakarta Pusat" ...

[1] 1707

        Kabupaten Kebumen           Kota Banda Aceh               Kota Manado
                        7                        10                        33
    Kabupaten Tasikmalaya             Kota Semarang             Kota Surabaya
                       35                        41                        52
             Kota Bandung       Kota Bandar Lampung Kabupaten Lampung Selatan
                       54                        58                        61
         Kabupaten Bantul        Kabupaten Wonogiri               Kota Padang
                       68                        71                        81
               Kota Medan           Kota Yogyakarta          Kabupaten Sleman
                       85                       117                       120

[1] "The answer is: Kabupten Kebumen"

<h3>18</h3>
Berapa jumlah karyawan yang kemungkinan besar menyempatkan untuk berwisata ke Keraton Yogyakarta, Pantai Parangtritis, atau wisata Kaliurang selama masa mudiknya?
Asumsi karyawan yang mudik ke DIY saja yang kemungkinan besar berwisata ke tempat tersebut

In [99]:
data.location %>%
    group_by(lokasi_dominan) %>%
    summarise(
        employee = n_distinct(id)
    ) %>%
    filter(
        lokasi_dominan %in% c('Kota Yogyakarta',
                              'Kabupaten Sleman')
    )
paste('The answer is:',
      ' 29 Employees')

  lokasi_dominan   employee
1 Kabupaten Sleman 15
2 Kota Yogyakarta  14

[1] "The answer is:  29 Employees"

<h3>19</h3>
Tanggal berapakah menjadi favorit pulang ke Jabodetabek

In [100]:
data.transport = as.data.frame(colSums(data.mudik.final[,5:(dim(data.mudik.final)[2]-2)]))
colnames(data.transport) = c('count')

# Count of employees who have 'mudik'
lag.one = cbind(0,
             t(data.transport[,]))
lag.one = lag.one[-length(lag.one)] # Erase last element in vector move
data.transport = data.frame(data.transport,
                            lag.one)
data.transport %>%
    mutate(
        date = rownames(data.transport),
        count.of.mudik = lag.one - count
    ) %>%
    arrange(count.of.mudik) %>%    
    head()
paste('The answer is:',
      '9th of June')

  count lag.one date    count.of.mudik
1 100    0      May_21  -100
2  66   17      June_9   -49
3  98   81      June_11  -17
4  81   66      June_10  -15
5  17    9      June_8    -8
6 100   97      June_14   -3

[1] "The answer is: 9th of June"

<h3>20</h3>
Ada karyawan yang pulang ke Lampung Selatan dengan ID 80. Tanggal berapa dia sudah kembali ke Jabodetabek

In [101]:
data.final %>%
    filter(id == 80)
paste('The answer is:',
      '8th of June')

  id jenis_kelamin divisi       umur May_21     May_22        May_23
1 80 Perempuan     Data Science 33   Kota Bogor Jakarta Barat Jakarta Selatan
  May_24     May_25        May_26          ... June_6
1 Kota Bogor Jakarta Barat Jakarta Selatan ... Kabupaten Lampung Selatan
  June_7                    June_8              June_9     June_10
1 Kabupaten Lampung Selatan Kabupaten Tangerang Kota Bogor Jakarta Selatan
  June_11       June_12    June_13         June_14       June_15
1 Jakarta Barat Kota Bogor Jakarta Selatan Jakarta Barat Kota Bogor

[1] "The answer is: 8th of June"

<h3>21</h3>
Pada tanggal berapa seluruh karyawan TokoLapak sudah ada di Jabodetabek

In [102]:
case.21 = colSums(data.mudik.final[,5:(dim(data.mudik.final)[2]-2)])
head(sort(case.21,
          decreasing = TRUE))
paste('The answer is:',
      '14th of June')

 May_21  May_22 June_14 June_15  May_24  May_25
    100     100     100     100      98      98

[1] "The answer is: 14th of June"

<h3>22</h3>
Berapakah median dari umur seluruh karyawan TokoLapak

In [103]:
case.22 = median(data.final$umur)
paste('The answer is:',
      case.22)

[1] "The answer is: 27"

<h3>23</h3>
Berapakah jumlah karyawan TokoLapak

In [104]:
case.23 = dim(data.employee)[1]
paste('The answer is:',
      case.23,
      'Employee')

[1] "The answer is: 100 Employee"

<h3>24</h3>
Divisi apakah yang persentase pemudiknya paling sedikit

In [105]:
data.mudik.final %>%
    group_by(
        divisi
    ) %>%
    summarise(
        count = n(),
        count.mudik = sum(status.total),
        perc.mudik = 1-round(x = count.mudik/count,
                             digits = 2)
    ) %>%
    arrange(perc.mudik)
paste('The answer is:',
     'Software Engineer')

  divisi                count count.mudik perc.mudik
1 Software Engineer     31    4           0.87
2 Marketing              9    1           0.89
3 Data Engineer         14    1           0.93
4 Business Intelligence 21    1           0.95
5 Customer Service      15    0           1.00
6 Data Science          10    0           1.00

[1] "The answer is: Software Engineer"

<h3>25</h3>
Karyawan yang memiliki peluang untuk dititipi Lapis Legit Dzulaikha

In [106]:
data.location %>%
    filter(
        lokasi_dominan == 'Kota Medan'
    ) %>%
    group_by(id) %>%
    summarise(employee = n()) %>%
    arrange(desc(id)) %>%
    head()
paste('The answer is:',
     'Employee with ID 94')

  id employee
1 94 7
2 87 9
3 63 8
4 61 5
5 58 7
6 49 2

[1] "The answer is: Employee with ID 94"